Revit 2027 API
CurveLoop.GetPlane Method
 Gets the plane of the curve loop, if it is planar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Plane GetPlane()
Public Function GetPlane As Plane
public:
Plane^ GetPlane()
member GetPlane : unit -> Plane
Return Value
Plane
 The plane of the curve loop.
Exceptions
Exception | Condition
InvalidOperationException |  The curve loop does not lie in a single plane.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace